{"ir_version":"1.0","types":["Symbol('void')","Symbol('int')","Symbol('char')","Symbol('float')","Symbol('double')","Symbol('bool')","Function('fn_type')(Symbol('int'), Symbol('int'), Symbol('int'), Symbol('int'))"],"exprs":["Symbol('a')","Symbol('b')","Integer(2)","Mul(Symbol('b'), Integer(2))","Symbol('a')","Symbol('b')","Mul(Symbol('a'), Pow(Symbol('b'), Integer(-1)))","Add(Mul(Symbol('b'), Integer(2)), Mul(Integer(-1), Mul(Symbol('a'), Pow(Symbol('b'), Integer(-1)))))","Symbol('c')","Mul(Add(Mul(Symbol('b'), Integer(2)), Mul(Integer(-1), Mul(Symbol('a'), Pow(Symbol('b'), Integer(-1))))), Symbol('c'))","Add(Symbol('a'), Mul(Add(Mul(Symbol('b'), Integer(2)), Mul(Integer(-1), Mul(Symbol('a'), Pow(Symbol('b'), Integer(-1))))), Symbol('c')))"],"decls":[{"name":"arith","kind":"func","srepr":"Lambda((Symbol('a'), Symbol('b'), Symbol('c')), Add(Symbol('a'), Mul(Add(Mul(Symbol('b'), Integer(2)), Mul(Integer(-1), Mul(Symbol('a'), Pow(Symbol('b'), Integer(-1))))), Symbol('c'))))"}]}
