{"ir_version":"1.0","types":[{"id":0,"kind":"void"},{"id":1,"kind":"int"},{"id":2,"kind":"char"},{"id":3,"kind":"float"},{"id":4,"kind":"double"},{"id":5,"kind":"bool"},{"id":6,"kind":"uint"},{"id":7,"kind":"enum","tag":"E","underlying":6,"items":[{"name":"A","value":1},{"name":"B","value":2},{"name":"C","value":5}]},{"id":8,"kind":"uint"},{"id":9,"kind":"array","elem":2,"count":16},{"id":10,"kind":"pointer","pointee":1},{"id":11,"kind":"record","tag":"S","union":false,"complete":true,"fields":[{"name":"a","type":1},{"name":"b","type":8,"bits":3},{"name":"name","type":9},{"name":"p","type":10}]},{"id":12,"kind":"qualified","base":0,"quals":["const"]},{"id":13,"kind":"pointer","pointee":12},{"id":14,"kind":"qualified","base":0,"quals":["const"]},{"id":15,"kind":"pointer","pointee":14},{"id":16,"kind":"function","ret":1,"params":[13,15],"varargs":false},{"id":17,"kind":"pointer","pointee":16},{"id":18,"kind":"qualified","base":1,"quals":["const"]},{"id":19,"kind":"pointer","pointee":18},{"id":20,"kind":"array","elem":2,"count":16},{"id":21,"kind":"qualified","base":0,"quals":["const"]},{"id":22,"kind":"pointer","pointee":21},{"id":23,"kind":"qualified","base":0,"quals":["const"]},{"id":24,"kind":"pointer","pointee":23},{"id":25,"kind":"function","ret":1,"params":[22,24],"varargs":false},{"id":26,"kind":"pointer","pointee":25},{"id":27,"kind":"pointer","pointee":0},{"id":28,"kind":"function","ret":1,"params":[26,27,1],"varargs":false},{"id":29,"kind":"qualified","base":0,"quals":["const"]},{"id":30,"kind":"pointer","pointee":29},{"id":31,"kind":"qualified","base":0,"quals":["const"]},{"id":32,"kind":"pointer","pointee":31},{"id":33,"kind":"function","ret":1,"params":[30,32],"varargs":false},{"id":34,"kind":"pointer","pointee":33},{"id":35,"kind":"pointer","pointee":0},{"id":36,"kind":"pointer","pointee":3},{"id":37,"kind":"function","ret":36,"params":[],"varargs":false},{"id":38,"kind":"qualified","base":2,"quals":["const"]},{"id":39,"kind":"pointer","pointee":38},{"id":40,"kind":"function","ret":1,"params":[39],"varargs":true},{"id":41,"kind":"qualified","base":2,"quals":["const"]},{"id":42,"kind":"pointer","pointee":41}],"decls":[{"id":0,"kind":"typedef","name":"cmp_t","type":17,"linkage":"none"},{"id":1,"kind":"var","name":"gp","type":19,"linkage":"internal"},{"id":2,"kind":"var","name":"buf","type":20,"linkage":"external"},{"id":3,"kind":"func","name":"sort","type":28,"linkage":"external","params":[{"name":"cmp","type":34},{"name":"arr","type":35},{"name":"n","type":1}],"body":null},{"id":4,"kind":"func","name":"mk","type":37,"linkage":"external","params":[],"body":null},{"id":5,"kind":"func","name":"log_msg","type":40,"linkage":"external","params":[{"name":"fmt","type":42}],"body":null}],"stmts":[],"exprs":[]}
