{"ir_version":"1.0","types":[{"id":0,"kind":"void"},{"id":1,"kind":"int"},{"id":2,"kind":"char"},{"id":3,"kind":"float"},{"id":4,"kind":"double"},{"id":5,"kind":"bool"},{"id":6,"kind":"pointer","pointee":0},{"id":7,"kind":"pointer","pointee":0},{"id":8,"kind":"function","ret":1,"params":[6,7],"varargs":false},{"id":9,"kind":"pointer","pointee":8},{"id":10,"kind":"pointer","pointee":1},{"id":11,"kind":"int"},{"id":12,"kind":"pointer","pointee":0},{"id":13,"kind":"pointer","pointee":0},{"id":14,"kind":"function","ret":1,"params":[12,13],"varargs":false},{"id":15,"kind":"pointer","pointee":14},{"id":16,"kind":"pointer","pointee":0},{"id":17,"kind":"function","ret":1,"params":[15,16,1],"varargs":false},{"id":18,"kind":"pointer","pointee":0},{"id":19,"kind":"pointer","pointee":0},{"id":20,"kind":"function","ret":1,"params":[18,19],"varargs":false},{"id":21,"kind":"pointer","pointee":20},{"id":22,"kind":"pointer","pointee":0},{"id":23,"kind":"pointer","pointee":3},{"id":24,"kind":"function","ret":23,"params":[],"varargs":false},{"id":25,"kind":"pointer","pointee":2},{"id":26,"kind":"function","ret":1,"params":[25],"varargs":true},{"id":27,"kind":"pointer","pointee":2}],"decls":[{"id":0,"kind":"typedef","name":"cmp_t","type":9,"linkage":"none"},{"id":1,"kind":"var","name":"gp","type":10,"linkage":"internal"},{"id":2,"kind":"var","name":"buf","type":11,"linkage":"external"},{"id":3,"kind":"func","name":"sort","type":17,"linkage":"external","params":[{"name":"cmp","type":21},{"name":"arr","type":22},{"name":"n","type":1}],"body":null},{"id":4,"kind":"func","name":"mk","type":24,"linkage":"external","params":[],"body":null},{"id":5,"kind":"func","name":"log_msg","type":26,"linkage":"external","params":[{"name":"fmt","type":27}],"body":null}],"stmts":[],"exprs":[]}
