{"ir_version":"1.0","types":[{"id":0,"kind":"void"},{"id":1,"kind":"int"},{"id":2,"kind":"char"},{"id":3,"kind":"float"},{"id":4,"kind":"double"},{"id":5,"kind":"bool"},{"id":6,"kind":"uint"},{"id":7,"kind":"enum","tag":"E","underlying":6,"items":[{"name":"A","value":1},{"name":"B","value":2},{"name":"C","value":5}]},{"id":8,"kind":"uint"},{"id":9,"kind":"array","elem":2,"count":16},{"id":10,"kind":"pointer","pointee":1},{"id":11,"kind":"record","tag":"S","union":false,"complete":true,"fields":[{"name":"a","type":1},{"name":"b","type":8,"bits":3},{"name":"name","type":9},{"name":"p","type":10}]},{"id":12,"kind":"pointer","pointee":0},{"id":13,"kind":"pointer","pointee":0},{"id":14,"kind":"function","ret":1,"params":[12,13],"varargs":false},{"id":15,"kind":"pointer","pointee":14},{"id":16,"kind":"pointer","pointee":1},{"id":17,"kind":"array","elem":2,"count":16},{"id":18,"kind":"pointer","pointee":0},{"id":19,"kind":"pointer","pointee":0},{"id":20,"kind":"function","ret":1,"params":[18,19],"varargs":false},{"id":21,"kind":"pointer","pointee":20},{"id":22,"kind":"pointer","pointee":0},{"id":23,"kind":"function","ret":1,"params":[21,22,1],"varargs":false},{"id":24,"kind":"pointer","pointee":0},{"id":25,"kind":"pointer","pointee":0},{"id":26,"kind":"function","ret":1,"params":[24,25],"varargs":false},{"id":27,"kind":"pointer","pointee":26},{"id":28,"kind":"pointer","pointee":0},{"id":29,"kind":"pointer","pointee":3},{"id":30,"kind":"function","ret":29,"params":[],"varargs":false},{"id":31,"kind":"pointer","pointee":2},{"id":32,"kind":"function","ret":1,"params":[31],"varargs":true},{"id":33,"kind":"pointer","pointee":2}],"decls":[{"id":0,"kind":"typedef","name":"cmp_t","type":15,"linkage":"none"},{"id":1,"kind":"var","name":"gp","type":16,"linkage":"internal"},{"id":2,"kind":"var","name":"buf","type":17,"linkage":"external"},{"id":3,"kind":"func","name":"sort","type":23,"linkage":"external","params":[{"name":"cmp","type":27},{"name":"arr","type":28},{"name":"n","type":1}],"body":null},{"id":4,"kind":"func","name":"mk","type":30,"linkage":"external","params":[],"body":null},{"id":5,"kind":"func","name":"log_msg","type":32,"linkage":"external","params":[{"name":"fmt","type":33}],"body":null}],"stmts":[],"exprs":[]}
